Chequi10/hagie_gui/stm32/stm32_worker.h
#ifndef STM32_WORKER_H
#define STM32_WORKER_H

#include <atomic>
#include <array>
#include <chrono>
#include <condition_variable>
#include <cstdint>
#include <deque>
#include <functional>
#include <memory>
#include <mutex>
#include <string>
#include <thread>

#include "core/hagie_state.h"
#include "stm32/stm32canbusif.h"


class STM32Worker
{
public:

    STM32Worker(
        HagieState *state,
        const std::string& port,
        uint32_t baudrate = 115200
    );

    ~STM32Worker();


    /*
     * No permitimos copiar este objeto.
     *
     * STM32Worker posee un hilo y una interfaz serie,
     * por lo que debe existir una única instancia.
     */
    STM32Worker(
        const STM32Worker&
    ) = delete;

    STM32Worker& operator=(
        const STM32Worker&
    ) = delete;


    // ========================================================
    // Control del worker
    // ========================================================

    bool start();

    void stop();

    bool isRunning() const;


    // ========================================================
    // Callback de conexión STM32
    // ========================================================

    /*
     * connected = true:
     * STM32 conectada/reconectada.
     *
     * connected = false:
     * comunicación STM32 perdida.
     */
    using connection_callback =
        std::function<void(bool connected)>;


    void setConnectionCallback(
        connection_callback callback
    );


    // ========================================================
    // Comandos hacia STM32
    // ========================================================

    void setTargetHeight(
        uint8_t body,
        uint16_t height_mm
    );


    void setValveCommand(
        uint8_t body,
        int16_t command
    );


    void stopAllValves();


    void clearBodyFault(
        uint8_t body
    );


    // ========================================================
    // Configuración runtime STM32 - OPCODE 'K'
    // ========================================================

    void setBodyLimits(
        uint8_t body,
        uint16_t min_height_mm,
        uint16_t max_height_mm
    );


    void setMoveCommandThreshold(
        uint16_t threshold
    );


    void setMinBodyMovement(
        float movement_mm
    );


    void setNoMovementTimeout(
        uint32_t timeout_ms
    );


    void setTargetTimeout(
        uint32_t timeout_ms
    );


    void setEncoderDirection(
        uint8_t body,
        uint8_t direction
    );


    void setEncoderScale(
        uint8_t body,
        float mm_per_pulse
    );

    void setEncoderMaximum(
        uint8_t body,
        uint32_t maximum_count
    );

    void setEncoderCalibration(
        uint8_t body,
        const int32_t *positions,
        const uint16_t *heights_mm,
        uint8_t point_count
    );

    void setHydraulicManagementMode(
        uint8_t mode
    );


    void setHydraulicHighCommandThreshold(
        uint16_t threshold
    );


    void setHydraulicMaxHighDemandBodies(
        uint8_t max_bodies
    );


    void setHydraulicSecondaryPercent(
        uint8_t percent
    );
    void setHeightControlKp(float kp);
    void setHeightControlKi(float ki);
    void setHeightControlKd(float kd);
    void setHeightControlDeadband(float deadband_mm);

        void setHeightUpCompensationPercent(
        uint8_t body,
        int8_t percent
    );

    void setHeightDownCompensationPercent(
        uint8_t body,
        int8_t percent
    );


    enum class ConfigSyncStatus
    {
        PENDING,
        SYNCHRONIZED,
        ERROR
    };


    ConfigSyncStatus getConfigSyncStatus() const;


    void beginConfigurationSync();


private:

    // ========================================================
    // Copia de configuración para resincronizar al reconectar
    // ========================================================
    static constexpr std::size_t
        MAX_ENCODER_CALIBRATION_POINTS =
            15;
    struct RuntimeConfiguration
    {
        bool valid = false;


        std::array<
            uint16_t,
            HagieState::BODY_COUNT
        > min_height_mm {};


        std::array<
            uint16_t,
            HagieState::BODY_COUNT
        > max_height_mm {};


        std::array<
            uint8_t,
            HagieState::BODY_COUNT
        > encoder_direction {};


        std::array<
            float,
            HagieState::BODY_COUNT
        > encoder_scale {};

        std::array<
            uint32_t,
            HagieState::BODY_COUNT
        > encoder_maximum {};

        std::array<
            uint8_t,
            HagieState::BODY_COUNT
        > encoder_calibration_count {};

        std::array<
            std::array<
                int32_t,
                MAX_ENCODER_CALIBRATION_POINTS
            >,
            HagieState::BODY_COUNT
        > encoder_calibration_position {};

        std::array<
            std::array<
                uint16_t,
                MAX_ENCODER_CALIBRATION_POINTS
            >,
            HagieState::BODY_COUNT
        > encoder_calibration_height_mm {};


        uint16_t move_command_threshold =
            100;


        float min_body_movement_mm =
            2.0f;


        uint32_t no_movement_timeout_ms =
            1000;


        uint32_t target_timeout_ms =
            1000;

                // ----------------------------------------------------
        // Gestión hidráulica
        // ----------------------------------------------------

        uint8_t hydraulic_management_mode =
            0;

        uint16_t hydraulic_high_command_threshold =
            700;

        uint8_t hydraulic_max_high_demand_bodies =
            2;

        uint8_t hydraulic_secondary_percent =
            40;  
            
            // ----------------------------------------------------
            // Sintonía control de altura
            // ----------------------------------------------------

            float height_control_kp =
                5.0f;

            float height_control_ki =
                0.0f;

            float height_control_kd =
                0.0f;

            float height_control_deadband_mm =
                10.0f;
                    // ----------------------------------------------------
            // Compensación hidráulica individual por cuerpo
            // ----------------------------------------------------

            std::array<
                int8_t,
                HagieState::BODY_COUNT
            > height_up_compensation_percent {};


            std::array<
                int8_t,
                HagieState::BODY_COUNT
            > height_down_compensation_percent {};
    };
    RuntimeConfiguration runtimeConfig;


    /*
     * Reenvía la última configuración conocida
     * después de una reconexión STM32.
     */
    void enqueueRuntimeConfiguration();


    struct ConfigAckState
    {
        bool received = false;

        uint8_t subcommand = 0;

        uint8_t body = 0xFF;

        uint8_t status = 0;

        uint32_t value1 = 0;

        uint32_t value2 = 0;
    };


    ConfigAckState lastConfigAck;


    mutable std::mutex configAckMutex;


    /*
     * ========================================================
     * Seguimiento de ACK de configuración
     * ========================================================
     */

    std::array<
        bool,
        HagieState::BODY_COUNT
    > configAckLimits {};


    std::array<
        bool,
        HagieState::BODY_COUNT
    > configAckDirection {};


    std::array<
        bool,
        HagieState::BODY_COUNT
    > configAckScale {};


    bool configAckMoveThreshold =
        false;


    bool configAckMinMovement =
        false;


    bool configAckNoMovementTimeout =
        false;


    bool configAckTargetTimeout =
        false;


    ConfigSyncStatus configSyncStatus =
        ConfigSyncStatus::PENDING;


    // ========================================================
    // Callback de conexión
    // ========================================================

    connection_callback onConnection;


    void notifyConnectionState(
        bool connected
    );


    // ========================================================
    // Hilo principal STM32
    // ========================================================

    void workerLoop();


    // ========================================================
    // Cola de comandos TX
    // ========================================================

    enum class CommandType
    {
        SET_TARGET_HEIGHT,
        SET_VALVE_COMMAND,
        STOP_ALL_VALVES,
        CLEAR_BODY_FAULT,

        SET_BODY_LIMITS,
        SET_MOVE_COMMAND_THRESHOLD,
        SET_MIN_BODY_MOVEMENT,
        SET_NO_MOVEMENT_TIMEOUT,
        SET_TARGET_TIMEOUT,
        SET_ENCODER_DIRECTION,
        SET_ENCODER_SCALE,

        SET_HYDRAULIC_MANAGEMENT_MODE,
        SET_HYDRAULIC_HIGH_COMMAND_THRESHOLD,
        SET_HYDRAULIC_MAX_HIGH_DEMAND_BODIES,
        SET_HYDRAULIC_SECONDARY_PERCENT,

        SET_HEIGHT_CONTROL_KP,
        SET_HEIGHT_CONTROL_KI,
        SET_HEIGHT_CONTROL_KD,
        SET_HEIGHT_CONTROL_DEADBAND
    };


    struct Command
    {
        CommandType type;


        uint8_t body = 0;


        /*
         * Usado por comandos de válvula
         * y algunos valores simples.
         */
        int16_t value = 0;


        /*
         * Dos uint16_t para límites min/max.
         */
        uint16_t value_u16_1 = 0;

        uint16_t value_u16_2 = 0;


        /*
         * Timeouts.
         */
        uint32_t value_u32 = 0;


        /*
         * Movimiento mínimo y escala encoder.
         */
        float value_float = 0.0f;
    };


    void enqueueCommand(
        const Command& command
    );


    void processTxQueue();


    // ========================================================
    // Configuración de callbacks RX
    // ========================================================

    void configureCallbacks();


    // ========================================================
    // Estado compartido
    // ========================================================

    HagieState *state;


    // ========================================================
    // Puerto serie
    // ========================================================

    std::string port;

    uint32_t baudrate;


    // ========================================================
    // Interfaz existente STM32
    // ========================================================

    std::unique_ptr<
        stm32canbus_serialif
    > stm32;


    // ========================================================
    // Control del hilo
    // ========================================================

    std::atomic<bool> running;


    std::thread workerThread;


    std::mutex txMutex;


    std::deque<Command> txQueue;


    std::mutex configMutex;


    /*
     * ========================================================
     * Sincronización secuencial de configuración
     * ========================================================
     *
     *  0..5   -> K01 cuerpos 0..5
     *  6      -> K02
     *  7      -> K03
     *  8      -> K04
     *  9      -> K05
     * 10..15  -> K06 cuerpos 0..5
     * 16..21  -> K07 cuerpos 0..5
    * 22      -> K10 modo gestión hidráulica
    * 23      -> K11 umbral demanda fuerte
    * 24      -> K12 máximo cuerpos alta demanda
    * 25      -> K13 porcentaje secundario
    * 26      -> K14 Kp control altura
    * 27      -> K15 Ki control altura
    * 28      -> K16 Kd control altura
    * 29      -> K17 banda muerta
    * 30..35  -> K18 compensación subida cuerpos 0..5
    * 36..41  -> K19 compensación bajada cuerpos 0..5
    * 42..47  -> K08 máximo encoder cuerpos 0..5
    * 48..53  -> K09 calibración encoder cuerpos 0..5
    * 54      -> terminada
    */

    static constexpr uint8_t
        CONFIG_SYNC_COMMAND_COUNT =
            54;


    uint8_t configSyncStep =
        0;


    bool configCommandPending =
        false;


    uint8_t configRetryCount =
        0;


    std::chrono::steady_clock::time_point
        configCommandSentTime;


    /*
     * Enviar únicamente el comando correspondiente
     * al paso actual de sincronización.
     */
    void sendCurrentConfigurationCommand();


    /*
     * Procesar timeout / reintento de la
     * sincronización de configuración.
     */
    void processConfigurationSync();
};


#endif